# pandas tutorial
this notebook explains...

install libraries

In [92]:
# pip install pandas
# pip install numpy

- import libraries

In [61]:
import pandas as pd
import numpy as np

In [62]:
# objec creation
s= pd.Series([1,5,np.nan,8,7,])
s

0    1.0
1    5.0
2    NaN
3    8.0
4    7.0
dtype: float64

In [63]:
dates = pd.date_range("20241114",periods=6)
dates

DatetimeIndex(['2024-11-14', '2024-11-15', '2024-11-16', '2024-11-17',
               '2024-11-18', '2024-11-19'],
              dtype='datetime64[ns]', freq='D')

In [64]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("AHMB"))
df

                   A         H         M         B
2024-11-14  1.040473  0.603929 -0.507982  0.307292
2024-11-15  0.956409 -0.014955  1.201962  0.234072
2024-11-16 -0.865353 -0.955519 -0.000056  0.001634
2024-11-17 -0.068845  0.212958 -0.203065 -0.291519
2024-11-18 -1.130323 -1.351303  0.983766 -0.158387
2024-11-19  1.802748 -0.079829 -0.421098 -0.687656

In [65]:
df2 = pd.DataFrame(
    {
        "A" :1.0,
        "H":pd.Timestamp("20241114"),
        "M":pd.Series(1,index=list(range(4)),dtype="float32"),
        "B":np.array([4,3,2,1],dtype="int32"),
        "C":pd.Categorical([" bus","train","flight","car"]),
        "D":"males",
    }
)
df2

     A          H    M  B       C      D
0  1.0 2024-11-14  1.0  4     bus  males
1  1.0 2024-11-14  1.0  3   train  males
2  1.0 2024-11-14  1.0  2  flight  males
3  1.0 2024-11-14  1.0  1     car  males

In [66]:
df2.dtypes

A          float64
H    datetime64[s]
M          float32
B            int32
C         category
D           object
dtype: object

In [67]:
df2.head(2)

     A          H    M  B      C      D
0  1.0 2024-11-14  1.0  4    bus  males
1  1.0 2024-11-14  1.0  3  train  males

In [68]:
df2.tail(2)

     A          H    M  B       C      D
2  1.0 2024-11-14  1.0  2  flight  males
3  1.0 2024-11-14  1.0  1     car  males

In [69]:
df2.index

Index([0, 1, 2, 3], dtype='int64')

In [70]:
df.to_numpy()

array([[ 1.04047282e+00,  6.03929172e-01, -5.07981662e-01,
         3.07291656e-01],
       [ 9.56408780e-01, -1.49549276e-02,  1.20196216e+00,
         2.34071883e-01],
       [-8.65352723e-01, -9.55519082e-01, -5.55531919e-05,
         1.63426170e-03],
       [-6.88450411e-02,  2.12958479e-01, -2.03064594e-01,
        -2.91519015e-01],
       [-1.13032283e+00, -1.35130258e+00,  9.83765951e-01,
        -1.58386530e-01],
       [ 1.80274823e+00, -7.98293210e-02, -4.21097568e-01,
        -6.87655921e-01]])

In [71]:
df.describe()

              A         H         M         B
count  6.000000  6.000000  6.000000  6.000000
mean   0.289185 -0.264120  0.175588 -0.099094
std    1.164186  0.739886  0.735408  0.366945
min   -1.130323 -1.351303 -0.507982 -0.687656
25%   -0.666226 -0.736597 -0.366589 -0.258236
50%    0.443782 -0.047392 -0.101560 -0.078376
75%    1.019457  0.155980  0.737811  0.175962
max    1.802748  0.603929  1.201962  0.307292

In [72]:
# to transform
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
H,2024-11-14 00:00:00,2024-11-14 00:00:00,2024-11-14 00:00:00,2024-11-14 00:00:00
M,1.0,1.0,1.0,1.0
B,4,3,2,1
C,bus,train,flight,car
D,males,males,males,males

In [73]:
df.sort_index(axis=1,ascending=False)

                   M         H         B         A
2024-11-14 -0.507982  0.603929  0.307292  1.040473
2024-11-15  1.201962 -0.014955  0.234072  0.956409
2024-11-16 -0.000056 -0.955519  0.001634 -0.865353
2024-11-17 -0.203065  0.212958 -0.291519 -0.068845
2024-11-18  0.983766 -1.351303 -0.158387 -1.130323
2024-11-19 -0.421098 -0.079829 -0.687656  1.802748

In [74]:
df.sort_values(by="A")

                   A         H         M         B
2024-11-18 -1.130323 -1.351303  0.983766 -0.158387
2024-11-16 -0.865353 -0.955519 -0.000056  0.001634
2024-11-17 -0.068845  0.212958 -0.203065 -0.291519
2024-11-15  0.956409 -0.014955  1.201962  0.234072
2024-11-14  1.040473  0.603929 -0.507982  0.307292
2024-11-19  1.802748 -0.079829 -0.421098 -0.687656

In [75]:
df["M"]

2024-11-14   -0.507982
2024-11-15    1.201962
2024-11-16   -0.000056
2024-11-17   -0.203065
2024-11-18    0.983766
2024-11-19   -0.421098
Freq: D, Name: M, dtype: float64

In [76]:
# row wise selection
df[0:2]

                   A         H         M         B
2024-11-14  1.040473  0.603929 -0.507982  0.307292
2024-11-15  0.956409 -0.014955  1.201962  0.234072

In [77]:
df.loc[dates[1]]

A    0.956409
H   -0.014955
M    1.201962
B    0.234072
Name: 2024-11-15 00:00:00, dtype: float64

In [78]:
df.loc[:,["H","B"]]

                   H         B
2024-11-14  0.603929  0.307292
2024-11-15 -0.014955  0.234072
2024-11-16 -0.955519  0.001634
2024-11-17  0.212958 -0.291519
2024-11-18 -1.351303 -0.158387
2024-11-19 -0.079829 -0.687656

In [79]:
df.loc["20241115":"20241118",["A","M"]]

                   A         M
2024-11-15  0.956409  1.201962
2024-11-16 -0.865353 -0.000056
2024-11-17 -0.068845 -0.203065
2024-11-18 -1.130323  0.983766

In [80]:
df.loc[["20241114","20241119"],["A","H","M"]]

                   A         H         M
2024-11-14  1.040473  0.603929 -0.507982
2024-11-19  1.802748 -0.079829 -0.421098

In [81]:
df.loc["20241115",["A","B"]]

A    0.956409
B    0.234072
Name: 2024-11-15 00:00:00, dtype: float64

In [82]:
df.at[dates[0],"A"]

np.float64(1.0404728186048569)

In [83]:
df.iloc[3]

A   -0.068845
H    0.212958
M   -0.203065
B   -0.291519
Name: 2024-11-17 00:00:00, dtype: float64

In [84]:
df.iloc[0:3]

                   A         H         M         B
2024-11-14  1.040473  0.603929 -0.507982  0.307292
2024-11-15  0.956409 -0.014955  1.201962  0.234072
2024-11-16 -0.865353 -0.955519 -0.000056  0.001634

In [85]:
df.iloc[0:2,0:3]

                   A         H         M
2024-11-14  1.040473  0.603929 -0.507982
2024-11-15  0.956409 -0.014955  1.201962

In [86]:
df[df["A"]>-1]

                   A         H         M         B
2024-11-14  1.040473  0.603929 -0.507982  0.307292
2024-11-15  0.956409 -0.014955  1.201962  0.234072
2024-11-16 -0.865353 -0.955519 -0.000056  0.001634
2024-11-17 -0.068845  0.212958 -0.203065 -0.291519
2024-11-19  1.802748 -0.079829 -0.421098 -0.687656

In [87]:
df[df>0]

                   A         H         M         B
2024-11-14  1.040473  0.603929       NaN  0.307292
2024-11-15  0.956409       NaN  1.201962  0.234072
2024-11-16       NaN       NaN       NaN  0.001634
2024-11-17       NaN  0.212958       NaN       NaN
2024-11-18       NaN       NaN  0.983766       NaN
2024-11-19  1.802748       NaN       NaN       NaN

In [88]:
df3 = df.copy()

In [89]:
df3["newcolo"] = [1,2,"three",4,5,6]
df3

                   A         H         M         B newcolo
2024-11-14  1.040473  0.603929 -0.507982  0.307292       1
2024-11-15  0.956409 -0.014955  1.201962  0.234072       2
2024-11-16 -0.865353 -0.955519 -0.000056  0.001634   three
2024-11-17 -0.068845  0.212958 -0.203065 -0.291519       4
2024-11-18 -1.130323 -1.351303  0.983766 -0.158387       5
2024-11-19  1.802748 -0.079829 -0.421098 -0.687656       6

In [91]:
# df3["c"] = [df3["A"]+1.0]